app/Controllers/Api/Karyawan.php


        if ($mode=='update') {

            $simpan = $this->KaryawanModel->where('id', $id)
            ->set($datanya)
            ->update();
---
UPDATE `karyawan` SET `email` = 'aaa@gmail.com', `password` = '123', `fotonya` = '1657361552_83db32583052db0d34c3.png', `nama` = 'qasdsad', `tanggal_lahir` = '2022-07-12', `gaji` = '2321', `status_karyawan` = '1', `updated_at` = '2022-07-09 20:33:50'
WHERE `id` = '4'

    public function listkaryawan(){
        $listkaryawan = $this->KaryawanModel->findAll();
---
SELECT *
FROM `karyawan`