app/Controllers/Api/Karyawan.php

UPDATE `karyawan` SET `nama` = 'TEST UPDATE DARI POSTMAN', `tanggal_lahir` = '2022-06-15', `gaji` = '9000000', `status_karyawan` = '0', `updated_at` = '2022-06-10 17:24:00'
WHERE `id` = '12'
---
    public function simpan(){

        // dd($this->request->getVar());

        $mode   = $this->request->getVar('mode');
        $id     = $this->request->getVar('id');

        if ($mode=='update') {
            $datanya = [
                'nama'              => $this->request->getVar('nama'),
                'tanggal_lahir'    => $this->request->getVar('tanggal_lahir'),
                'gaji'              => $this->request->getVar('gaji'),
                'status_karyawan'   => $this->request->getVar('status_karyawan'),
            ];

            $simpan = $this->KaryawanModel->where('id', $id)
            ->set($datanya)
            ->update();

SELECT *
FROM `karyawan`
---
    public function listkaryawan(){
        $listkaryawan = $this->KaryawanModel->findAll();

DELETE FROM `karyawan`
WHERE `id` = '8'
---
    public function hapuskaryawan(){
        $id = $this->request->getVar('id');

            $cek = $this->db->query("SELECT * from karyawan WHERE id='$id'")->getNumRows();

            if ($cek > 0) {
                $hapus = $this->KaryawanModel
                ->where('id', $id)
                ->delete();