app/Controllers/Api/Menu.php

    public function index()
    {
        $menunya    = $this->request->getVar('menu');

        if ($menunya == 'Karyawan') {
            $data = [
                'judul' => $menunya
            ];
            return view('dashboard/karyawan', $data);
        }
        elseif ($menunya == 'Tambah Karyawan') {
            $id = $this->request->getVar('id');

            $listkaryawan = $this->KaryawanModel->where('id', $id)
            ->first();;
---
SELECT *
FROM `karyawan`
WHERE `id` IS NULL
 LIMIT 1