app/Models/KaryawanModel.php

SELECT *
FROM `karyawan`
WHERE `email` = 'aaa@gmail.com'
AND `password` = '123'
 LIMIT 1
---
    public function loginKaryawan($email = false,$password = false){

        // dd($email." | ".$password);

        return $this->where(
            [
                'email'=>$email,
                'password'=>$password,
            ]
        )->first();